tap "dail8859/notepadnext"
tap "domt4/autoupdate"
tap "fastrepl/hyprnote"
tap "felixkratz/formulae"
tap "jesseduffield/lazydocker"
tap "joncrangle/tap"
tap "koekeishiya/formulae"
tap "krishkrosh/apps"
tap "manaflow-ai/cmux"
tap "nikitabobko/tap"
tap "openpubkey/opkssh"
tap "steipete/tap"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Automate deployment, configuration, and upgrading
brew "ansible"
# Checks ansible playbooks for practices and behaviour
brew "ansible-lint"
# Automatic configure script builder
brew "autoconf"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Resource monitor. C++ version and continuation of bashtop and bpytop
brew "btop"
# Modern, maintained replacement for ls
brew "eza"
# Like neofetch, but much faster because written mostly in C
brew "fastfetch"
# Play, record, convert, and stream select audio and video codecs
brew "ffmpeg"
# User-friendly command-line shell for UNIX-like operating systems
brew "fish"
# Command-line fuzzy finder written in Go
brew "fzf"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Enable transparent encryption/decryption of files in a git repo
brew "git-crypt"
# Better way to clone, organize and manage multiple git repositories
brew "git-get"
# Git extension for versioning large files
brew "git-lfs"
# GNU Privacy Guard (OpenPGP)
brew "gnupg"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Post-modern modal text editor
brew "helix"
# Improved top (interactive process viewer)
brew "htop"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Tools and libraries to manipulate images in select formats
brew "imagemagick"
# Update of iperf: measures TCP, UDP, and SCTP bandwidth
brew "iperf3"
# Featureful UNIX password cracker
brew "john"
# Simple terminal UI for git commands
brew "lazygit"
# Mac App Store command-line interface
brew "mas"
# Deep clean and optimize your Mac
brew "mole"
# Free (GNU) replacement for the Pico text editor
brew "nano"
# Fast, highly customisable system info script
brew "neofetch"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Small build system for use with gyp or CMake
brew "ninja"
# Port scanning utility for large networks
brew "nmap"
# Tiny, lightning fast, feature-packed file manager
brew "nnn"
# Open-source, cross-platform JavaScript runtime environment
brew "node"
# Manage multiple Node.js versions
brew "nvm"
# Create, run, and share large language models (LLMs)
brew "ollama"
# Development kit for the Java programming language
brew "openjdk"
# Tools and libraries for smart cards
brew "opensc"
# Swiss-army knife of markup format conversion
brew "pandoc"
# Shell command parallelization utility
brew "parallel"
# Search PDFs for strings matching a regular expression
brew "pdfgrep"
# General-purpose scripting language
brew "php"
# Display the PID number for a given process name
brew "pidof"
# Pinentry for GPG on Mac
brew "pinentry-mac"
# Python dependency management tool
brew "pipenv"
# Execute binaries from Python packages in isolated environments
brew "pipx"
# Package compiler and linker metadata toolkit
brew "pkgconf"
# Protocol buffers (Google's data interchange format)
brew "protobuf"
# Python version management
brew "pyenv"
# Interpreted, interactive, object-oriented programming language
brew "python@3.12"
# Python interface to Tcl/Tk
brew "python-tk@3.12"
# Interpreted, interactive, object-oriented programming language
brew "python@3.10"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# Tools for and transforming and inspecting PDF files
brew "qpdf"
# Messaging and streaming broker
brew "rabbitmq"
# Rsync for cloud storage
brew "rclone"
# Safe, concurrent, practical language
brew "rust"
# Web crawling & scraping framework
brew "scrapy"
# Simple keystroke visualizer
brew "showkey"
# SOcket CAT: netcat on steroids
brew "socat"
# Cross-shell prompt for astronauts
brew "starship"
# OCR (Optical Character Recognition) engine
brew "tesseract"
# Terminal multiplexer
brew "tmux"
# Anonymizing overlay network for TCP
brew "tor"
# Lightweight BitTorrent client
brew "transmission-cli"
# Extremely fast Python package installer and resolver, written in Rust
brew "uv"
# Bundler for JavaScript and friends
brew "webpack"
# Internet file retriever
brew "wget"
# Tools for the WireGuard secure network tunnel
brew "wireguard-tools"
# Yet Another Dotfiles Manager
brew "yadm"
# JavaScript package manager
brew "yarn"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# Geo-scale, next-generation sharing platform built on top of OpenZiti
brew "zrok"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# A window border system for macOS
brew "felixkratz/formulae/borders"
# Custom macOS statusbar with shell plugin, interaction and graph support
brew "felixkratz/formulae/sketchybar"
# A simple terminal UI for docker, written in Go
brew "jesseduffield/lazydocker/lazydocker"
# Simple system stats event provider for SketchyBar
brew "joncrangle/tap/sketchybar-system-stats"
# opkssh (OpenPubKey SSH) - SSH with OpenID Connect
brew "openpubkey/opkssh/opkssh"
# Password manager that keeps all passwords secure behind one password
cask "1password"
# View, print, and comment on PDF documents
cask "adobe-acrobat-reader"
# AeroSpace is an i3-like tiling window manager for macOS
cask "nikitabobko/tap/aerospace"
# Application uninstaller
cask "appcleaner"
# Chromium based browser
cask "arc"
# Tool to flash OS images to SD cards & USB drives
cask "balenaetcher"
# Web browser focusing on privacy
cask "brave-browser"
# Web security testing toolkit
cask "burp-suite"
# Web debugging Proxy application
cask "charles"
# Menu bar usage monitor for Codex and Claude
cask "steipete/tap/codexbar"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker-desktop"
# Online diagram software
cask "drawio"
# Web browser
cask "firefox"
# Web browser
cask "firefox@nightly"
cask "font-hack-nerd-font"
cask "font-sf-mono"
cask "font-sf-pro"
cask "font-sketchybar-app-font"
# Desktop client for GitHub repositories
cask "github"
# Web browser
cask "google-chrome"
# Web browser
cask "google-chrome@beta"
# Web browser
cask "google-chrome@canary"
# Web browser
cask "google-chrome@dev"
# Open Source Multimedia Framework
cask "gstreamer-runtime"
# Hex editor focussing on speed
cask "hex-fiend"
# Keyboard customiser
cask "karabiner-elements"
# File system integration
cask "macfuse"
# Video format converter (transcoder)
cask "makemkv"
# Multi-platform web browser
cask "microsoft-edge"
# Set of tools to create, alter and inspect Matroska files (MKV)
cask "mkvtoolnix-app"
# Interactive tool for analyzing MongoDB data
cask "mongodb-compass"
# Web browser focused on privacy and on minimizing tracking and fingerprinting
cask "mullvad-browser"
# VPN client
cask "mullvad-vpn"
# Reverse proxy, secure introspectable tunnels to localhost
cask "ngrok"
# Collaboration platform for API development
cask "postman"
# G-code generator for 3D printers (RepRap, Makerbot, Ultimaker etc.)
cask "prusaslicer"
# Companion app for Flipper Zero devices
cask "qflipper"
# Control your tools with a few keystrokes
cask "raycast"
# Tool that provides consistent, highly configurable symbols for apps
cask "sf-symbols"
# Instant messaging application focusing on security
cask "signal"
# Lightweight CSV editor
cask "tablecruncher"
# Native GUI for Homebrew package management
cask "taphouse"
# Open-source BitTorrent client
cask "transmission"
# Free and open-source OpenVPN client
cask "tunnelblick"
# Virtual machines UI using QEMU
cask "utm"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Remote desktop application focusing on security
cask "vnc-viewer"
# Rust-based terminal
cask "warp"
# Compatibility layer to run Windows applications
cask "wine-stable"
# Network protocol analyzer
cask "wireshark-app"
# Video communication and virtual meeting platform
cask "zoom"
# Collect, organise, cite, and share research sources
cask "zotero"
vscode "anthropic.claude-code"
vscode "britesnow.vscode-toggle-quotes"
vscode "chrisdias.vscode-opennewinstance"
vscode "christian-kohler.npm-intellisense"
vscode "darkriszty.markdown-table-prettify"
vscode "docker.docker"
vscode "eseom.nunjucks-template"
vscode "euskadi31.json-pretty-printer"
vscode "github.codespaces"
vscode "github.github-vscode-theme"
vscode "github.vscode-github-actions"
vscode "github.vscode-pull-request-github"
vscode "golang.go"
vscode "hediet.vscode-drawio"
vscode "james-yu.latex-workshop"
vscode "leosj29.jsf-primefaces-intellisense"
vscode "mads-hartmann.bash-ide-vscode"
vscode "mongodb.mongodb-vscode"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-de"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-python.vscode-python-envs"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "openai.chatgpt"
vscode "redhat.ansible"
vscode "redhat.vscode-yaml"
vscode "svelte.svelte-vscode"
vscode "tamasfe.even-better-toml"
vscode "vscode-icons-team.vscode-icons"
vscode "vue.volar"
vscode "wholroyd.jinja"
vscode "xdebug.php-debug"
vscode "xdebug.php-pack"
vscode "yy0931.vscode-sqlite3-editor"
vscode "yzhang.markdown-all-in-one"
vscode "zobo.php-intellisense"
